/**
 * @file prog01/app/inc/user/audio/ego.h
 *
 * エンベロープジェネレータ
 *
 * @date 2024.11.04 k.shibata newly created
 */

#if !defined(USER_AUDIO_EGO_H__)
#define USER_AUDIO_EGO_H__

//////////////////////////////////////////////////////////////////////////////
// includes
//////////////////////////////////////////////////////////////////////////////

#include <user/types.h>

#include <stdbool.h>
#include <stdint.h>

//////////////////////////////////////////////////////////////////////////////
// defines
//////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////
// typedef
//////////////////////////////////////////////////////////////////////////////

/**
 * @brief エンベロープジェネレータパラメータ構造体
 */
typedef struct tagEGOParam_t {
  uint32_t t_atk;    //< アタック時間
  int32_t d_atk;     //< 音量増分
  uint32_t t_decay;  //< ディケイ時間
  int32_t d_decay;   //< ディケイ音量増分
  uint32_t t_rel;    //< リリース時間 サスティーン音量から0になるまでの時間
  int32_t d_rel;     //< リリース音量増分
} EGOParam_t;

/**
 * @brief エンベロープジェネレータオブジェクト
 */
typedef struct tagEGO_t {
  const EGOParam_t* param;  //< パラメータ
  int32_t v;                //< 出力値
  uint32_t t;               //< 経過時間
  bool isRel;               //< リリース識別
} EGO_t;

//////////////////////////////////////////////////////////////////////////////
// prototype
//////////////////////////////////////////////////////////////////////////////

#ifdef __cplusplus
extern "C" {
#endif  //__cplusplus

/**
 * @brief エンベロープジェネレータのパラメータを出力します.
 * ピーク音量(0-65535), アタックタイム(単位:サンプル), ディケイタイム(単位:サンプル), サスティーン音量(0-65535)
 * リリースタイム(単位:サンプル) を入力として パラメータを出力します
 * @param [out] param : パラメータ出力先
 * @param [in] peak : ピーク音量 (0-65535) 最大音量(0-65535 = 0.0 ... 1.0)
 * @param [in] atk : アタック時間 キーオンからピーク音量までの到達時間(単位: サンプル)
 * @param [in] decay : アタック時間到達後, 持続音量(サスティーン音量) までの到達時間(単位:サンプル)
 * @param [in] sus : 持続音量 (0-65535) (0-65535 = 0.0 ... 1.0)
 * @param [in] rel : キーオフで, サスティーン音量から音量が0になるまでの時間(単位:サンプル)
 * @return 処理結果
 */
UError_t EGOParam_Create(EGOParam_t* param, uint32_t peak, uint32_t atk, uint32_t decay, uint32_t sus, uint32_t rel);

/**
 * @brief 現在値を取得する
 * 現在値を返し, 内部状態を1サンプル進めます
 * @param [in] ctx : 処理対象
 * @return 現在地
 * @retval 正常終了時: EGOの現在値
 * @retval 異常時: 0u
 */
uint32_t EGO_Get(EGO_t* ctx);

/**
 * @brief 発音状態に遷移します
 * @param [in] ctx : 処理対象
 */
void EGO_NoteOn(EGO_t* ctx);

/**
 * @brief リリース状態に遷移します
 * @param [in] ctx : 処理対象
 * @return なし
 */
void EGO_NoteOff(EGO_t* ctx);

#ifdef __cplusplus
}
#endif  //__cplusplus

//////////////////////////////////////////////////////////////////////////////
// variable
//////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////
// function
//////////////////////////////////////////////////////////////////////////////

#endif  // USER_AUDIO_EGO_H__
